app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-07-15 13:13:56.227885"], ["updated_at", "2022-07-15 13:13:56.227885"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 73]]
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find(params[:id])