app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"
---
  def index
    @carts = Cart.all

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-07-19 07:55:43.373320"], ["updated_at", "2022-07-19 07:55:43.373320"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find(params[:id])