app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    #@line_item = @cart.line_items.build(product: product)
    #@line_item = LineItem.new(line_item_params)


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 5], ["cart_id", 71], ["created_at", "2022-07-21 11:09:10.418989"], ["updated_at", "2022-07-21 11:09:10.418989"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2022-07-22 09:27:04.393738"], ["id", 34]]