app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    #@line_item = @cart.line_items.build(product: product)
    #@line_item = LineItem.new(line_item_params)


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 207281424], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-07-19 07:55:43.060958"], ["updated_at", "2022-07-19 07:55:43.060958"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2022-07-19 07:55:43.069520"], ["updated_at", "2022-07-19 07:55:43.069520"]]

  def destroy
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]