app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lea"], ["address", "A"], ["email", "lea@gmail.com"], ["pay_type", 2], ["created_at", "2022-07-21 11:09:37.969142"], ["updated_at", "2022-07-21 11:09:37.969142"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 71]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def ensure_cart_isnt_empty
      if @cart.line_items.empty?
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 75], ["LIMIT", 1]]