app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "MyString"], ["description", "MyText"], ["image_url", "lorem.jpg"], ["price", 9.99], ["created_at", "2022-07-19 09:41:04.328492"], ["updated_at", "2022-07-19 09:41:04.328492"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save