app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
---
  def index
    @products = Product.all.order(:title)

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Seven  mobile apps "], ["description", "xvzb"], ["image_url", "bbb"], ["price", 0.0], ["created_at", "2022-07-13 06:48:15.754929"], ["updated_at", "2022-07-13 06:48:15.754929"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."product_id" = ? ORDER BY "orders"."updated_at" DESC LIMIT ?  [["product_id", 5], ["LIMIT", 1]]
---
  def who_bought
    @product = Product.find(params[:id])
    @latest_order = @product.orders.order(:updated_at).last

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])