app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "p"], ["password_digest", "$2a$12$V3fwLSeSePxYjSEEHxf/zOsYGWgsm5GLFVbq7bdaQZidE4H2jusMe"], ["created_at", "2022-07-21 10:18:42.606216"], ["updated_at", "2022-07-21 10:18:42.606216"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])